Repository: CanisBolt/MyTaskManagerWPF
Catalog: MyTaskManagerWPF/Resource.*.resx
Languages: ru

# ChooseTaskView
source: Which tasks would you like to view?{0}1. All tasks{0}2. All active tasks{0}3. All archived tasks{0}4. By urgency{0}0. Cancel
ru: Выберите, какие задачи вы хотели бы посмотреть?{0}1. Все задачи{0}2. Все активные задачи{0}3. Все архивные задачи{0}4. По срочности{0}0. Отмена

# MainMenuPrompt
source: Choose an action:{0}1. View tasks{0}2. Add tasks{0}3. Delete tasks{0}4. Save tasks{0}5. Load tasks{0}6. Edit tasks{0}7. Mark as complete{0}0. Exit program
ru: Выберите действие:{0}1. Просмотр задач{0}2. Добавление задач{0}3. Удаление задач{0}4. Сохранение задач{0}5. Загрузка задач{0}6. Редактировать задачу{0}7. Отметить как выполненную{0}0. Выйти из программы

source: No archive tasks.
ru: Нет архивных задач.

# NoTasksFound
source: Task list is empty!
ru: Список задач пуст!

source: Enter task name:
ru: Введите название задачи:

source: Task name cannot be empty!
ru: Название задачи не может быть пустым!

# EnterTaskDescription
source: Enter task decription:
ru: Введите текст задачи:

# TaskDescriptionCannotBeEmpty
source: Task text cannot be empty!
ru: Текст задачи не может быть пустым!

# ChoosePriority
source: Please choose the task's importance level:{0}1. Low{0}2. Medium{0}3. High{0}4. Urgent
ru: Выберите степень важности задачи:{0}1. Низкая{0}2. Средняя{0}3. Высокая{0}4. Срочная

source: Invalid input.
ru: Неверный ввод.

# InvalidInputYesNo
source: Invalid input. Please enter yes or no.
ru: Неверный ввод. Введите да или нет.

source: Task successfully added!
ru: Задача успешно добавлена!

# DeleteActiveOrArchive
source: Enter 1 to delete active tasks, 2 to delete archived tasks:
ru: Введите 1 для удаления активных задач, 2 для удаления архивных задач:

# ChooseTaskToDelete
source: Enter the sequential number of the task you want to delete. (Enter 0 to cancel):
ru: Введите порядковый номер задачи, которую хотите удалить. (Для отмены введите 0):

source: Task successfully deleted!
ru: Задача успешно удалена!

# ChooseTaskToEdit
source: Enter the sequential file number to edit. 0 to cancel editing:
ru: Введите порядковый номер файла для редактирования. 0 для отмены редактирования:

source: Task successfully updated!
ru: Задача успешно обновлена!

# MarkAsCompletedPrompt
source: Mark task as complete? (yes/no)
ru: Отметить задачу как выполненную? (да/нет)

# MoveToArchivePrompt
source: Would you like to move this task to the archive? (yes/no).
ru: Желаете переместить данную задачу в архив? (да/нет).

# TaskCompletedAndArchived
source: Task completed and added to archive!
ru: Задача выполнена и добавлена в архив!

# DeleteAfterCompletionPrompt
source: Do you want to delete this task from the list? (yes/no)
ru: Желаете удалить данную задачу из списка? (да/нет)

# TaskDeletedFromList
source: Task removed from list.
ru: Задача удалена из списка.

source: No files to load:
ru: Нет файлов для загрузки:

# FilesToLoadList
source: List of files to load:
ru: Список файлов для загрузки:

# ChooseFileToLoad
source: Enter the sequential file number to load. 0 to cancel loading:
ru: Введите порядковый номер файла для загрузки. 0 для отмены загрузки:

# CurrentDataWillBeErased
source: Warning! Current data will be erased! Are you sure you want to continue? (yes/no)
ru: Внимание! Текущие данные будут стерты! Вы уверены, что хотите продолжить? (да/нет)

# LoadCancelled
source: Load canceled!
ru: Операция загрузки отменена!

# LoadErrorFileEmpty
source: Error: File {0} is empty or contains invalid data.
ru: Ошибка: Файл {0} пуст или содержит некорректные данные.

# ErrorCorruptedJson
source: Error processing task file: {0}. The file might be corrupted or in an invalid JSON format.
ru: Ошибка при обработке файла задач: {0}. Возможно, файл поврежден или имеет неверный формат JSON.

# ErrorDetails
source: Details: {0}
ru: Подробности: {0}

# ErrorGeneric
source: An error occurred while loading tasks: {0}
ru: Произошла ошибка при загрузке задач: {0}

# LoadFailed
source: Could not load!
ru: Не удалось загрузить!

# DataLoadedSuccessfully
source: Data successfully loaded!
ru: Данные успешно загружены!

# EnterSaveFileName
source: Enter the save file name. At least three characters.
ru: Введите имя файла сохранения. Не менее трех символов.

# SaveFileNameTooShort
source: Invalid input. Please enter a name with at least three characters!
ru: Неверный ввод. Введите имя не менее трех символов!

# FileExistsOverwriteWarning
source: Warning! all data will be overwritten! Are you sure you want to continue? (yes/no):
ru: Внимание! Данные будут полностью перезаписаны! Вы уверены, что хотите продолжить? (да/нет):

# SaveCancelled
source: Save canceled!
ru: Операция сохранения отменена!

source: Tasks successfully saved!
ru: Задачи успешно сохранены!

# ErrorFileNotFound
source: Error: File {0} not found.
ru: Ошибка: Файл {0} не найден.

# NoTasksForDeletion
source: No active tasks to delete.
ru: Нет активных задач для удаления.

# NoTasksWithPriority
source: No tasks with the specified priority!
ru: Нет задач с указанным приоритетом!

# TaskCreated
source: Created:
ru: Создана:

# TaskPriority
source: Priority
ru: Приоритет:

source: No active tasks.
ru: Нет активных задач.

# NoArchiveTasksForDeletion
source: Not archive tasks to delete.
ru: Нет архивных задач для удаления.

# DisplayTaskByPriority
source: {0}. {1}{2}Created: {3}{2}{4}{2}Priority: {5}
ru: {0}. {1}{2}Создана: {3}{2}{4}{2}Приоритет: {5}

# ArchiveHeader
source: {0}ARCHIVE:{1}
ru: {0}АРХИВ:{1}

# ChooseLanguagePrompt
source: Choose a language:{0}1. Русский{0}2. English
ru: Выберите язык:{0}1. Русский{0}2. English

# LanguageChangedSuccessfully
source: The language has been successfully changed to {0}!
ru: Язык успешно изменен на {0}!

# YesAnswer
source: Yes
ru: Да

# NoAnswer
source: No
ru: Нет
